---
kind: property
id: P:Autodesk.Revit.DB.ACADExportOptions.LineScaling
source: html/8e197871-e18e-4270-6292-1bbdabe96ff0.htm
---
# Autodesk.Revit.DB.ACADExportOptions.LineScaling Property

The scaling mode for the line type.
 Default value is LineScaling.ViewScale.

## Syntax (C#)
```csharp
public LineScaling LineScaling { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration